import React from 'react'
import { Link } from 'react-router-dom'

// components
import Header from '../../components/header/Header'
// img
import backImg from '../../resources/home/home_bg_01.webp'
import backImgMob from '../../resources/home/home_bg-mob_01.webp'
import homeImg_01 from '../../resources/home/home_img_01.webp'

// scss
import './HomePage.scss'

function HomePage() {
	return (
		<div className='home-wrapper'>
			<div className='backImg__wrapper'>
				<img className='backImg desktop' src={backImg} alt='background' />
				<img className='backImg mobile' src={backImgMob} alt='background' />

				<div className='home__footer'>
					<div className='container'>
						<div className='home__footer-title'>Условия проведения акции</div>
						<p>
							В рамках игрового процесса участникам предоставляется возможность
							получения двух промокодов, предоставляющих скидку на добровольное
							страхование имущества физических лиц. Получение промокодов
							осуществляется автоматически после успешного выполнения игрового
							задания. Размер скидки (7% или 20%) определяется уровнем игрового
							прогресса.
						</p>
						<p>
							Каждый промокод подлежит однократному применению при оформлении
							полиса РГС.Квартира в онлайн-режиме; не подлежит комбинированию
							с другими акционными предложениями; действителен
							до 31.03.2025 включительно. Применение промокода возможно
							исключительно в отношении одного полиса. Действителен только
							для подписочного продукта РГС.Квартира. Не подлежит обмену
							на денежный эквивалент.
						</p>
						<p>
							Для активации скидки необходимо ввести полученный
							код в соответствующее поле интерфейса при оформлении полиса.
							Ответственность за корректность ввода данных лежит на участнике
							акции. Организатор вправе вносить изменения в условия акции
							с предварительной публикацией актуальной редакции на официальном
							сайте. Участие в акции означает безоговорочное согласие
							с настоящими условиями. Акция регулируется законодательством
							Российской Федерации.
						</p>
						<p>
							Лицензии ЦБ РФ: ОС № 0001–02, выдана 23.12.2019, СИ № 0001,
							СЛ № 0001, ОС № 0001–03, ОС № 0001–04,
							ОС № 0001–05 и на осуществление перестрахования ПС № 0001, выданы
							06.06.2018; бессрочные
						</p>
						<p>
							© ПАО СК «Росгосстрах» 140002, Московская обл., г. Люберцы, ул.
							Парковая, д. 3
						</p>
					</div>
				</div>
			</div>
			<>
				<Header />
			</>
			<div className='home'>
				<div className='container'>
					<div className='home__wrapper'>
						<h1 className='home__h1'>В жизни всякое может случиться</h1>
						<p>
							Прокачайте страховую и финансовую грамотность и узнайте, в каких
							жизненных ситуациях страховки реально выручают!
						</p>
						<p>
							<span>
								Вас ждут мини-квесты в 6 квартирах, секретный бонус в одной
								из них и скидка на страховую защиту жилья в конце игры.
							</span>
						</p>
						<Link className='btn' to='/preview-disaster'>
							Играть
						</Link>
					</div>

					<div className='home__img'>
						<img src={homeImg_01} alt='img' />
					</div>
				</div>
			</div>
		</div>
	)
}

export default HomePage
